Autodesk.Navisworks.Api.GridLevel
A grid level

Autodesk.Navisworks.Api.GridLevel.ClosestIntersection(Autodesk.Navisworks.Api.Point3D)
Returns the intersection of the grid level closest to a given 3D point.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.GridLevel.DisplayName
Name of the grid level as diplayed in the GUI.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridLevel.Elevation
Evelation of the grid level.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridLevel.IsReadOnly
Gets a value indicating whether the object is read-only.